# OnStandby Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet..::..OnStandby Property
MechanicalEquipmentSet Class See Also
---
The number of pieces of mechanical equipment that are not operational at any given time.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int OnStandby { get; set; }
```

Visual Basic
---
```text
Public Property OnStandby As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int OnStandby {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: There should be at least one equipment on duty. |

# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace